[{"author":"GK","create_at":"2016-11-06","rating":"5","body":"nice, big but gold looks fake"},{"author":". Zietlow","create_at":"2016-10-06","rating":"1","body":"It looks like someone took fingernail polish and tried to stay in the lines. Red is smeared and very messy. Wish I didn't get."},{"author":"nicholas gravelding","create_at":"2016-09-28","rating":"5","body":"great quality!! love it. super fast seller"},{"author":"hitt","create_at":"2016-09-27","rating":"5","body":"I got this for my husband after he saw one similar to this and liked it. It seems to be well made but he hasn't worn it really yet. It looks very nice. I believe it was worth the amount of money I paid for it"},{"author":"Christy Hathaway","create_at":"2016-08-04","rating":"5","body":"Came quickly and looks like I paid much more for it."},{"author":"Tyreek Reaves","create_at":"2016-07-04","rating":"4","body":"I like it, it could've been a lil bigger but it's fine (thumbs up)"},{"author":"Amazon Customer","create_at":"2016-07-04","rating":"5","body":"I love it!! It's solid and a little heavy but perfect!!"},{"author":"Amazon Customer","create_at":"2016-04-18","rating":"4","body":"Like that it is light weight but was unhappy that it had a deep scratch in it."},{"author":"ani in hawaii","create_at":"2016-04-10","rating":"5","body":"This USA flag pendant is really nice. Made of great quality materials the chain is stainless steel and very detailed adding a lot of charm to the set. You can proudly display your patriotism while being stylish. The flag is well cut and as well polished and so s the chain. Comfortable to wear the whole day and not heavy either. The chain has a lobster clasp for closure and a small extender if you want it to be a little longer. This is great  buy and I do recommend it.I did order mine at a discounted rate to try it and share my unbiased opinion."},{"author":"missy sands","create_at":"2016-03-21","rating":"4","body":"I like the USA Flag Necklace by U7 Jewelry. The chain is very durable and is made of Stainless Steel and the Pendant:1.9 inches, chain:20+2 inches\/resizable. It looks to me like the flag is backwards, but that don't take away from the quality of the necklace. The necklace is a great way to show your patriotic side. It has a lobster clasp and I believe that it will last a long time. Nice Product.<br \/>I received this product on a promotional discount from the seller for the exchange of my honest unbiased review. These comments and my evaluation presented here are my own opinions ."}]