[{"author":"michael sencindiver","create_at":"2016-11-08","rating":"5","body":"The U7 Stainless Steel Dog Tag is a amazing dog tag to wear, its nice, held together nicely, and has prayer inside of it. The only problem ive faced with it so far is that if you sleep in this, it can get tangled up\/turned sideways, etc. Its packaging was very great! It came in a small jewerly box, and in fine packaging. It is such a luxury to have something like this. Id strongly reccomend to christians to wear."},{"author":"Kathi Wilker","create_at":"2016-09-28","rating":"5","body":"My husband is a vet and recently got ordained online and loves this. He performed his first wedding last weekend. This look svery nice and is not cheap or cheesy looking at all. The chain is also expandable. Just be care though as the top cross dog tag can get turned upside down easily.. LOL"},{"author":"Dan","create_at":"2016-09-03","rating":"5","body":"Love it, perfect size for me and probably for women to, great appearance, chain can be 20 or 24 inch without changes, just clip into the other eyelet; both pieces are slightly thick stainless steel.  There is noticable weight but still very comfortable for me (a little extra reminder  of Faith).  As a solder of God I should be able to wear an appropriate dog tag.  AND, it includes theLords Prayer on the back piece.<br \/><br \/>If you like the idea of wearing a crusafix, you will love this one."},{"author":"Daryl","create_at":"2016-09-01","rating":"5","body":"I love this necklace. It really stands out. Great quality. I would reccomend it."},{"author":"mary fedore","create_at":"2016-08-27","rating":"5","body":"Great Gift!!"},{"author":"Amazon Customer","create_at":"2016-08-17","rating":"5","body":"Better than expected and I expected it to be great. It is nice and heavy, looks real and fits great around my neck. Came in good packaging and was delivered fast as well."},{"author":"dward  Marquart","create_at":"2016-06-26","rating":"5","body":"Good buy. Good product."},{"author":"Amazon Customer","create_at":"2016-06-24","rating":"3","body":"Chain was had a kink that would not unravel had to buy a different one, love the pendant though."},{"author":"odd Dunklebarger","create_at":"2016-06-14","rating":"5","body":"I love this well made"},{"author":"Casey H","create_at":"2016-05-23","rating":"5","body":"This was purchased as a gift for my 13 year old son.  If you've ever tried to impress a teenager, you know that it's difficult.  However, he really likes it and has been wearing it to school."},{"author":"jack","create_at":"2016-05-13","rating":"5","body":"strong and nice."},{"author":"EJR123","create_at":"2016-05-06","rating":"5","body":"Exactly as described, very nice. I love it and the quality is excellent."}]